In [1]:
import pandas as pd
import numpy as np

In [3]:
rng=np.random.RandomState(0)
data=np.random.randint(0,10,4)
ser=pd.Series(data)
ser

0    6
1    9
2    6
3    9
dtype: int32

In [4]:
df=pd.DataFrame(np.random.randint(0,10,(3,4)),columns=("A","B","C","D"))
df

   A  B  C  D
0  8  7  4  1
1  4  4  8  3
2  0  5  0  7

# numpy general operation can be applied on pandas series and dataframe

since df.values and ser.values are the type of numpy array

In [6]:
np.exp(ser)

0     403.428793
1    8103.083928
2     403.428793
3    8103.083928
dtype: float64

In [7]:
np.exp(df)

             A            B            C            D
0  2980.957987  1096.633158    54.598150     2.718282
1    54.598150    54.598150  2980.957987    20.085537
2     1.000000   148.413159     1.000000  1096.633158

In [9]:
np.sin(df*np.pi/4)

              A             B             C         D
0 -2.449294e-16 -7.071068e-01  1.224647e-16  0.707107
1  1.224647e-16  1.224647e-16 -2.449294e-16  0.707107
2  0.000000e+00 -7.071068e-01  0.000000e+00 -0.707107

# 通用函数： 索引对齐

When we operate two series or two dataframes, pandas will 对齐 the indexs of the two objects
The pandas fill the lost values as NaN, but we can specified/fill any value you want on the lost values

The following is the examples

In [14]:
A=pd.Series([0,1,2],index=[0,1,2])
B=pd.Series([1,2,3],index=[1,2,3])
A+B

0    NaN
1    2.0
2    4.0
3    NaN
dtype: float64

In [15]:
np.add(A+B)

ValueError: invalid number of arguments

In [21]:
np.add(A,2)

0    2
1    3
2    4
dtype: int64

In [16]:
A.add(B)

0    NaN
1    2.0
2    4.0
3    NaN
dtype: float64

In [18]:
A.add(B,fill_value=0)

0    0.0
1    2.0
2    4.0
3    3.0
dtype: float64

In [23]:
A=pd.DataFrame(np.random.randint(0,10,(3,2)),columns=["A","B"])
B=pd.DataFrame(np.random.randint(0,10,(3,3)),columns=["A","B","C"])
A+B

    A   B   C
0  11  10 NaN
1   8  11 NaN
2  10  13 NaN

In [25]:
A.add(B)

    A   B   C
0  11  10 NaN
1   8  11 NaN
2  10  13 NaN

In [31]:
fill=A.mean(axis=1)
A.add(B,fill_value=fill)

    A   B     C
0  11  10  12.0
1   8  11  16.5
2  10  13  10.0

In [39]:
df=pd.DataFrame(np.random.randint(0,10,size=(4,4)))
df

   0  1  2  3
0  4  5  1  1
1  1  2  9  8
2  1  1  3  2
3  0  3  9  4

In [47]:
df.iloc[:,1]

0    5
1    2
2    1
3    3
Name: 1, dtype: int32

In [48]:
df-df.iloc[:,1]

   0  1  2  3
0 -1  3  0 -2
1 -4  0  8  5
2 -4 -1  2 -1
3 -5  1  8  1

In [51]:
df.subtract(df.iloc[:,1],axis=0)

   0  1  2  3
0 -1  0 -4 -4
1 -1  0  7  6
2  0  0  2  1
3 -3  0  6  1

# Pandas lost data's label with NaN

In [56]:
x=pd.Series([1,np.nan,2,None]) # the none object will be convert to NaN
x #dtype will be converted from interger to float64

0    1.0
1    NaN
2    2.0
3    NaN
dtype: float64

In [59]:
x[0]=None
x

0    NaN
1    NaN
2    2.0
3    NaN
dtype: float64

In [64]:
y=pd.Series([True,False,None])
y # dtype will be converted from boolen to Object

0     True
1    False
2     None
dtype: object

# How to query process the Nan

In [68]:
data=pd.Series([1,2,np.nan,None])
data.loc[data.isnull()]

2   NaN
3   NaN
dtype: float64

In [73]:
data.loc[data.notnull()]

0    1.0
1    2.0
dtype: float64

In [75]:
data.dropna()

0    1.0
1    2.0
dtype: float64

In [84]:
df=pd.DataFrame(np.random.randint(0,10,size=(3,4)))
df.iloc[0,1]=np.nan
df.iloc[1,2]=np.nan
df

   0    1    2  3
0  1  NaN  5.0  5
1  1  0.0  NaN  7
2  8  3.0  0.0  5

In [87]:
df.dropna()

   0    1    2  3
2  8  3.0  0.0  5

In [90]:
df.dropna(axis=1)

   0  3
0  1  5
1  1  7
2  8  5

In [93]:
df.fillna(0)

   0    1    2  3
0  1  0.0  5.0  5
1  1  0.0  0.0  7
2  8  3.0  0.0  5

In [99]:
df.mean(axis=0)

0    3.333333
1    1.500000
2    2.500000
3    5.666667
dtype: float64

In [101]:
df.fillna(df.mean(axis=0))

   0    1    2  3
0  1  1.5  5.0  5
1  1  0.0  2.5  7
2  8  3.0  0.0  5

In [103]:
df.fillna(method="ffill")

   0    1    2  3
0  1  NaN  5.0  5
1  1  0.0  5.0  7
2  8  3.0  0.0  5

# concat two dataframe

In [106]:
pd.concat?

In [111]:
df1=pd.DataFrame(np.random.randint(0,10,(2,2)),index=["a","b"],columns=["A","B"])
df2=pd.DataFrame(np.random.randint(0,10,(2,2)),index=["a","b"],columns=["A","B"])
pd.concat([df1,df2])

   A  B
a  9  5
b  8  2
a  9  8
b  0  8

In [119]:
pd.concat([df1,df2],ignore_index=True)

   A  B
0  9  5
1  8  2
2  9  8
3  0  8

In [123]:
pd.concat([df1,df2],verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['a', 'b'], dtype='object')

In [128]:
pd.concat([df1,df2],keys=["x","y"],names=["group","index"])

             A  B
group index
x     a      9  5
      b      8  2
y     a      9  8
      b      0  8

In [134]:
df1=pd.DataFrame(np.random.randint(0,10,(2,2)),index=["a","b"],columns=["A","B"])
df2=pd.DataFrame(np.random.randint(0,10,(2,2)),index=["a","b"],columns=["B","C"])
pd.concat([df1,df2])

c:\python\python37\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     A  B    C
a  1.0  1  NaN
b  5.0  5  NaN
a  NaN  3  8.0
b  NaN  8  3.0

In [136]:
pd.concat([df1,df2],join="inner")

   B
a  1
b  5
a  3
b  8

In [145]:
pd.concat([df1,df2],axis=1)

AttributeError: 'str' object has no attribute 'equals'